app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
   <strong>URL</strong> <%= link_to user_path(@user), @user %><br />
   <strong>posts</strong> <%= @user.posts.count %>