app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "ptitle", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "How are yoy"], ["created_at", Fri, 02 Nov 2012 11:48:44 UTC +00:00], ["ptitle", "Hello"], ["updated_at", Fri, 02 Nov 2012 11:48:44 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(params[:post])
    if @post.save