app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:per_page => 10, :page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
    def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(:page => params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = '978abceb11244134661abfb951f75ac33242ba65e0b0cf7a72c308032cc0904c', "updated_at" = '2012-11-02 11:32:34.533807' WHERE "users"."id" = 1
---
    def update
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy